/**
  ******************************************************************************
  * @file    bsp.c 
  * @author  
  * @version 
  * @date    
  * @brief   
  ******************************************************************************
  * @attention
  ******************************************************************************
  */  
/* Includes ------------------------------------------------------------------*/
#include "bsp.h"
/* Functions -----------------------------------------------------------------*/


/********************************************************************
**Function: BSP_Init
**Note 		: 板级初始化
**Input 	: None
**Output 	: None
**Use 		: BSP_Init();
*********************************************************************/
void BSP_Init(void)
{
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);	//设置中断优先级分组为组2：2位抢占优先级，2位响应优先级
	delay_init();																		//延时函数初始化	
	LED_Init();																			//LED初始化
	Reset_Init();
	//TIMER_Init(10000-1,4800-1);											//定时器初始化，周期1S

//	USART3_PM_Init(9600);														//串口3初始化
//	USART3_PM_DMA_Init();														//串口3_DMA初始化---PM传感器
	USART2_Send_Init();															//串口2初始化---透传模块
	
	//IWDG_Init(7,625);
}


